{
    "responseHeader":{
      "status":0,
      "QTime":4,
      "params":{
        "q":"panic",
        "defType":"edismax",
        "indent":"true",
        "qf":"name industry description",
        "start":"0",
        "q.op":"OR",
        "_":"1670750314497"}},
    "response":{"numFound":9,"start":0,"numFoundExact":true,"docs":[
        {
          "name":"FireEye",
          "rating":3.6,
          "reviews":112,
          "description":"The rules of engagement in today’s threat landscape are changing rapidly and as cyber-crime evolves, there is a security gap that can be exploited. As our dependency on technology further permeates our daily habits, the threats that exploit the security gap will have graver consequences.\n\nEvery day at FireEye, we see firsthand the impact of cyber-attacks on real people. This is what inspires us to fulfill our mission to relentlessly protect our customers from the impact and consequences of cyber attacks.\n\nWe have learned that technology alone isn’t enough to combat cyber attackers. Our fundamental belief is that hands-on front-line expertise and intelligence, combined with innovative technology, provides the best means to protect our customers from cyber threats.\n\nFireEye has created a unique learning system. Our real-time knowledge of the threat landscape ensures that our offerings provide the best means to protect our customers. We are constantly guided by our frontline expertise as we build our products, deliver threat intelligence and arm our services team to prepare for, respond to and prevent breaches.\n\nThe FireEye Innovation Cycle was created by product teams embracing our world-class frontline threat expertise AND our frontline experts embracing our solutions. We use this innovation cycle to create the most effective cyber defense platform – a seamless, on demand extension of our customers security operations.\n\nThat is our commitment, that is our difference. – less",
          "ratings.Management":3.1,
          "ratings.Culture":3.4,
          "locations.Remote":4.3,
          "headquarters":"601 McCarthy Blvd. Milpitas, CA 95035",
          "employees":7,
          "industry":"Information Technology",
          "revenue":4,
          "custom_rating":3.52,
          "ceo.count":59,
          "ceo.approval":73.0,
          "interview.difficulty":"Difficult",
          "interview.duration":"About a month",
          "interview.count":29,
          "id":"eb56bc9f-62d8-400a-9cf9-a69ed297a818",
          "ratings.Work_Life_Balance":3.7,
          "ratings.Compensation_Benefits":3.8,
          "ratings.Job_Security_Advancement":3.0,
          "locations.Milpitas__CA":3.7,
          "locations.Draper__UT":3.7,
          "locations.Detroit__MI":3.6,
          "locations.Reston__VA":3.5,
          "roles.Engineering_Technician":3.7,
          "roles.Account_Manager":3.5,
          "roles.Technical_Support_Engineer":3.3,
          "roles.Product_Manager":3.0,
          "roles.Software_Engineer":2.3,
          "salary.Account_Manager":28.92,
          "salary.Software_Engineer":13.45,
          "salary.Technical_Support_Engineer":9.78,
          "interview.experience_":["Favorable"],
          "_version_":1751911782572621824},
        {
          "name":"Security National Bank",
          "rating":4.2,
          "reviews":15,
          "description":"Security National Bank was chartered in 1884 in Sioux City, Iowa, founded on the time-tested principles of integrity, honor, open-mindedness, efficiency, good humor, respect, duty and human connection.\n\nThese principles served as guideposts that enabled SNB to withstand the economic panic of the late 1800s, the Great Depression, two World Wars and the farm crisis — and emerge as the region’s most established and trustworthy locally owned bank.\n\nWe believe what was worth doing well yesterday is still worth doing well today. People change and banking changes, but our time-tested principles remain.\n\nTo this day, we believe that doing what’s right is the only way to take care of customers, empower businesses, cultivate growth, inspire our community and accomplish the remarkable. – less",
          "ratings.Management":3.8,
          "ratings.Culture":3.8,
          "headquarters":"601 Pierce St. Sioux City, IA 51101",
          "employees":5,
          "industry":"Financial Services",
          "revenue":5,
          "custom_rating":4.09,
          "ceo.count":0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":9,
          "id":"6094e24d-72e2-4837-af79-64e6ecd3d111",
          "ratings.Work_Life_Balance":3.9,
          "ratings.Compensation_Benefits":4.3,
          "ratings.Job_Security_Advancement":3.8,
          "interview.experience_":["Average"],
          "_version_":1751911781429673984},
        {
          "name":"Risk Management Solutions (RMS)",
          "rating":3.0,
          "reviews":11,
          "description":"RMS models and software help insurers, financial markets, corporations, and public agencies evaluate and manage catastrophe risks throughout the world.\n\nWe lead an industry that we helped to pioneer—catastrophe risk modeling—and are the innovators of the RMS(one)® platform, which is transforming the world's understanding and quantification of risk through open, real-time exposure and risk management.\n\nMore than 400 insurers, reinsurers, trading companies, and other financial institutions trust RMS models and SaaS solutions to better understand and manage the risks of natural and human-made catastrophes, including hurricanes, earthquakes, floods, terrorism, and pandemics.\n\nWe think about the unthinkable, enabling the management of even the most extreme events. Our scientific and objective measurement of risk facilitates the efficient flow of capital needed to insure, manage, and ultimately mitigate these risks to reduce the consequences of disasters, promoting resilient societies and a sustainable global economy. – less",
          "ratings.Management":2.6,
          "ratings.Culture":2.9,
          "salary.Model":6.45,
          "custom_rating":2.99,
          "ceo.count":0,
          "interview.count":0,
          "id":"6339d18b-eb57-4e88-a9cb-19b41f92a85d",
          "ratings.Work_Life_Balance":3.1,
          "ratings.Compensation_Benefits":3.5,
          "ratings.Job_Security_Advancement":2.8,
          "salary.Director_of_Product_Management":14.85,
          "salary.Senior_Software_Engineer":15.7,
          "_version_":1751911782587301888},
        {
          "name":"Berlin Packaging",
          "rating":3.2,
          "reviews":54,
          "description":"Berlin Packaging exists to help people and companies become Greater, Faster. We are dedicated to those who want to achieve more, disrupt the status quo, and beat the competition. Packaging is the currency we use.\n\nWe are a Hybrid Packaging Supplier® of plastic, glass, metal containers, closures, and dispensing systems. We supply billions of packaging components annually to customers of all sizes in all industries.\n\nOur mission is to increase our customers’ bottom lines. We bring together the best elements of manufacturing, distribution, and income-generating service providers. With 35,000+ available SKUs, unlimited manufacturing platforms, 150+ packaging consultants, 100+ North American locations, and superior logistics skills, Berlin Packaging has the right products, expertise, and geographic proximity to help customers increase sales, lower costs, and improve productivity.\n\nBerlin Packaging’s suite of related services includes Studio One Eleven, a full-service custom packaging and graphic design division; Berlin Global Packaging Group, an international team handling custom packaging, order and quality management, and logistics; E3, a consulting division that helps customers unlock profit; Berlin Financial Services, which provides financing for capital equipment; Berlin Quality, a team dedicated to making quality a competitive advantage; Dangerous Goods, offering UN-certified packaging for shipping hazardous materials; Qorpak, a supplier of laboratory packaging and supplies; and Freund Container & Supply, a need-it-now packaging and industrial supplies provider.\n\nWe are maniacal about execution. We are the only company in our sector to be ISO 9001 certified, to be Customs-Trade Partnership Against Terrorism certified, and to achieve 99% on-time delivery every month for 11 years and counting. We quantify the value that our customers earn as a benefit of working with us. Our Anything is Possible® culture yields industry-leading customer thrill scores. – less",
          "ratings.Management":2.8,
          "ratings.Culture":2.8,
          "headquarters":"Chicago, IL",
          "employees":6,
          "industry":"Manufacturing",
          "revenue":7,
          "custom_rating":3.09,
          "ceo.count":21,
          "ceo.approval":76.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":18,
          "id":"8ae71ec0-8c51-49b3-acfc-e5b46a4abad8",
          "ratings.Work_Life_Balance":3.1,
          "ratings.Compensation_Benefits":3.2,
          "ratings.Job_Security_Advancement":2.7,
          "interview.experience_":["Favorable"],
          "_version_":1751911782972129280},
        {
          "name":"Center for Internet Security",
          "rating":4.7,
          "reviews":7,
          "description":"Center for Internet Security, Inc. is a forward-thinking, non-profit entity that harnesses the power of a global IT community to safeguard private and public organizations against cyber threats.\n\nThe CIS Controls™ and CIS Benchmarks™ are the global standard and recognized best practices for securing IT systems and data against the most pervasive attacks. These proven guidelines are continuously refined and verified by a volunteer, global community of experienced IT professionals.\n\nOur CIS Hardened Images are virtual machine emulations preconfigured to provide secure, on-demand, and scalable computing environments in the cloud.\n\nCIS is home to both the Multi-State Information Sharing and Analysis Center® (MS-ISAC®), the go-to resource for cyber threat prevention, protection, response, and recovery for U.S. State, Local, Tribal, and Territorial government entities, and the Elections Infrastructure Information Sharing and Analysis Center™ (EI-ISAC™), which supports the cybersecurity needs of U.S. State, Local and Territorial elections offices. – less",
          "ratings.Management":4.7,
          "ratings.Culture":4.7,
          "headquarters":"East Greenbush",
          "employees":5,
          "industry":"Information Technology",
          "revenue":3,
          "custom_rating":4.67,
          "ceo.count":0,
          "interview.count":0,
          "id":"a3eddfe6-880e-4971-80a6-319efd947315",
          "ratings.Work_Life_Balance":4.4,
          "ratings.Compensation_Benefits":4.6,
          "ratings.Job_Security_Advancement":4.7,
          "_version_":1751911782648119296},
        {
          "name":"BDP International",
          "rating":3.3,
          "reviews":231,
          "description":"Be it by air, ground or ocean, BDP International is in the business of moving raw materials and finished products around the globe. The company provides logistics services such as customs brokerage, freight forwarding, and warehousing and distribution for customers in a variety of industries, including chemicals and retail. It serves more than 4,000 customers worldwide, including DuPont, Panasonic, Revlon, and Johnson & Johnson. BDP International and its subsidiaries have about 25 offices in the US; internationally, it operates through subsidiaries, joint ventures, and agents in some 120 countries. President and CEO Richard Bolte Jr. and his family own the company, which was founded by his father in 1966.\n\nTo expand its presence internationally and domestically, the company established the BDP International Global Network, a partnership of small and midsized logistics firms that pool their resources together in order to compete against larger, more global transportation companies. As the logistics industry undergoes a period of consolidation, the global network was also created as a means to keep some of the larger players from snatching up some of the smaller ones. BDP counts about 100 subsidiaries, joint ventures, and partnerships as part of its global network.\n\nThe company continued to expand its borders in 2010. Citing a US and European demand in Vietnamese products, BDP created a subsidiary in Vietnam to serve customers that are sourcing more of their goods from that country. Also in mid-2010 the company acquired the remaining 50% stake it didn't already own in Euromodal, a Spain based logistics, customs brokerage, and warehousing services provider. The business entity, renamed Euromodal BDP International Spain, gives the company a good foothold in the Spanish market, as well as expands its customers' trading options in the Western Mediterranean region. Mexico was tapped in fall 2009 when BDP opened a new office in Mexico City to serve the Latin America market. It plans to start service in Singapore, as well.\n\nBDP definitely has its eye on the Middle East's chemical and petrochemical industry. In spring 2010 it entered into a joint venture with Kanoo Freight-Forwarding based in Bahrain. The company, now named BDP Kanoo Chemical Logistics, is headquartered in Saudi Arabia and offers logistics services, customs brokerage, warehousing and distribution, et al. Around the same time, it also partnered up with India-based Unique Global Logistics in a joint venture valued at more than $5 million. BDP holds the majority stake with 65%.\n\nBDP International also strengthened its position in the UK market in 2009 when it acquired Rostrum Forwarding, a freight forwarding firm. The deal gave BDP International access to receiving depots in Birmingham, Bristol, Heathrow, Leeds, London, and Manchester.\n\nAdditionally, BDP also added value to its services by obtaining PIP (Partners in Protection) certification. PIP is Canada's equivalent to the US Customs and Trade Partnership Against Terrorism (C-TPAT) program. Companies, especially those in the chemical industry, which represents about 65% of BDP's business, are finding more and more that they must prove PIP compliance. In essence, PIP operates as a security program for the commercial sector that is actively trading across borders. PIP members adhere to program guidelines to ensure that all procedural security measures are met. – less",
          "happiness.Achievement":3.3,
          "happiness.Learning":3.05,
          "happiness.Flexibility":2.95,
          "happiness.Purpose":2.8,
          "happiness.Support":2.7,
          "happiness.Appreciation":2.7,
          "happiness.Compensation":2.65,
          "happiness.Management":2.55,
          "happiness.Energy":2.55,
          "happiness.Inclusion":2.55,
          "happiness.Trust":2.5,
          "happiness.Belonging":2.5,
          "ratings.Management":2.8,
          "ratings.Culture":3.1,
          "headquarters":"Philadelphia, PA",
          "employees":7,
          "industry":"Consulting and Business Services",
          "revenue":7,
          "custom_rating":3.1,
          "ceo.count":115,
          "ceo.approval":77.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":38,
          "id":"15971f5b-c4c4-45fb-939e-084b63c328a1",
          "happiness.Work_Happiness_Score":2.4,
          "ratings.Work_Life_Balance":3.3,
          "ratings.Compensation_Benefits":3.1,
          "ratings.Job_Security_Advancement":2.9,
          "locations.Indianapolis__IN":4.2,
          "locations.Chicago__IL":4.0,
          "locations.Glen_Burnie__MD":4.0,
          "locations.Huntersville__NC":3.5,
          "locations.Philadelphia__PA":3.4,
          "roles.Compliance_Officer":3.6,
          "roles.Import_Manager":3.3,
          "roles.Logistic_Coordinator":3.3,
          "roles.Account_Manager":3.3,
          "roles.Export_Manager":3.2,
          "salary.Logistic_Coordinator":4.85,
          "salary.Document_Specialist":2.32,
          "salary.Export_Manager":5.71,
          "interview.experience_":["Favorable"],
          "_version_":1751911783617003521},
        {
          "name":"Epic Care",
          "rating":2.4,
          "reviews":41,
          "description":"Founded in the 1990’s, Epic Care is a group of board certified hematologists and oncologists based in the Northern East Bay area, dedicated to providing the newest breakthroughs and scientific innovations, as well as compassionate, trusting care. Since day one, we’ve strived to be more than just your specialist in your fight with cancer and blood disorders, we’ve strived to be your partner through it.\n\nThe lives we touch inspire us, so we pledge to do everything possible to make the unknown more manageable and comfortable to you. There’s no hiding it: illness and uncertainty can be frightening. We want to ensure that you get the exact treatment and support you need so you can conquer your fear when it hits hardest.\n\nYour health isn’t just a concern to you and us, but it’s a concern to your family, friends, and practitioners as well. Our ambition is to guide you through the process as seamlessly as possible, so we’ve aligned ourselves with the areas major medical providers and adapted our administration process to make paperwork as minimal as possible.\n\nDefining and providing you with the right treatment is a complex process, which is why we have a group of 30+ specialists working together to ensure that you receive the best possible care.\n\nFurthermore, Epic Care is the first facility in California to be Quality Oncology Practice Initiative (QOPI®) certified for Medical Oncology and accredited in Radiation Oncology and Diagnostic Radiology by the American College of Radiology (ACR).\n\nFrom the first diagnostic tests, treatment planning and administration, through the monitoring of treatment safety, effectiveness and outcome, we will support you with our professional expertise and personal compassion. We are your partners: the doctors, nurses, therapists and staff of Epic Care. – less",
          "happiness.Flexibility":3.1,
          "happiness.Achievement":2.95,
          "happiness.Purpose":2.95,
          "happiness.Learning":2.85,
          "happiness.Energy":2.85,
          "happiness.Appreciation":2.75,
          "happiness.Support":2.75,
          "happiness.Management":2.75,
          "happiness.Inclusion":2.65,
          "happiness.Compensation":2.45,
          "happiness.Trust":2.25,
          "happiness.Belonging":2.2,
          "ratings.Management":2.0,
          "ratings.Culture":2.5,
          "headquarters":"Antioch",
          "employees":4,
          "industry":"Healthcare",
          "revenue":3,
          "custom_rating":2.43,
          "ceo.count":14,
          "ceo.approval":71.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":21,
          "id":"666ab1f6-7f8f-4589-bd75-49afe4977329",
          "happiness.Work_Happiness_Score":2.75,
          "ratings.Work_Life_Balance":2.7,
          "ratings.Compensation_Benefits":2.1,
          "ratings.Job_Security_Advancement":2.2,
          "locations.Oakland__CA":3.7,
          "locations.Pleasant_Hill__CA":2.9,
          "locations.Emeryville__CA":2.2,
          "locations.Antioch__CA":1.9,
          "locations.Dublin__CA":1.7,
          "roles.Radiation_Therapist":3.3,
          "roles.Medical_Assistant":2.4,
          "roles.Medical_Receptionist":2.0,
          "roles.Laboratory_Assistant":1.0,
          "interview.experience_":["Favorable"],
          "_version_":1751911783381073920},
        {
          "name":"Centauri",
          "rating":4.4,
          "reviews":27,
          "description":"Centauri is a leading provider of high-end engineering, intelligence, cyber security and advanced technology solutions that keep our nation safe and secure from today’s adversaries and tomorrow’s threats. We bring together the brightest minds who thrive on developing disruptive technologies to overcome the most complex challenges. Our agile, mission-first approach empowers our advanced technical and operational teams to meet the real-time demands and high-impact missions of national defense agencies across land, air, sea and space.\n\nCentauri offers industry-leading flexibility, performance bonuses and a competitive 401k. It has been selected as one of the best companies to work for in America by The Great Place to Work Institute and as one of the top employers in the DC Metro area by the Washingtonian Magazine. – less",
          "ratings.Management":3.9,
          "ratings.Culture":4.3,
          "salary.Scientist":12.37,
          "headquarters":"15020 Conference Center Dr STE 100, Chantilly, VA 20151",
          "employees":9,
          "industry":"Consulting and Business Services",
          "revenue":5,
          "custom_rating":4.33,
          "ceo.count":11,
          "ceo.approval":82.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":6,
          "id":"6df78e4d-a5c3-44c4-9b48-8b86a3d7d85d",
          "ratings.Work_Life_Balance":4.7,
          "ratings.Compensation_Benefits":4.5,
          "ratings.Job_Security_Advancement":3.7,
          "salary.System_Engineer":12.6,
          "salary.Software_Engineer":13.38,
          "interview.experience_":["Favorable"],
          "_version_":1751911783514243072},
        {
          "name":"Support.com",
          "rating":2.7,
          "reviews":541,
          "happiness.Achievement":2.85,
          "happiness.Flexibility":2.65,
          "happiness.Support":2.6,
          "happiness.Learning":2.6,
          "happiness.Purpose":2.6,
          "happiness.Management":2.55,
          "happiness.Inclusion":2.5,
          "happiness.Appreciation":2.45,
          "happiness.Trust":2.25,
          "happiness.Energy":2.15,
          "happiness.Belonging":2.0,
          "happiness.Compensation":2.0,
          "ratings.Management":2.5,
          "ratings.Culture":2.6,
          "roles.Technician":3.8,
          "roles.Commander":3.3,
          "headquarters":"1200 Crossman Ave Sunnyvale, CA 94089",
          "employees":7,
          "industry":"Information Technology",
          "revenue":4,
          "custom_rating":2.59,
          "ceo.count":233,
          "ceo.approval":41.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":126,
          "id":"9db89e76-9a1b-4269-9ad6-d788b577fd3a",
          "happiness.Work_Happiness_Score":2.25,
          "ratings.Work_Life_Balance":2.8,
          "ratings.Compensation_Benefits":2.5,
          "ratings.Job_Security_Advancement":2.2,
          "locations.Redwood__CA":4.0,
          "locations.Jacksonville__FL":3.7,
          "locations.Indianapolis__IN":3.4,
          "locations.Orlando__FL":3.3,
          "locations.Redwood_City__CA":2.9,
          "roles.Personal_Technology_Expert":3.5,
          "roles.Sales_Representative":3.3,
          "roles.Solutions_Engineer":3.2,
          "salary.Service_Technician":10.49,
          "salary.Desktop_Support_Technician":9.77,
          "salary.Customer_Service_Technician":11.77,
          "interview.experience_":["Favorable"],
          "description":"Support.com is a full-spectrum leader in technical support solutions for businesses and consumers. With more than 20 years serving well-known brands, we have the expertise, tools, and software solutions to troubleshoot and maintain PCs and Macs, iOS and Android, and all the devices in the connected home — including home automation systems, home theaters, wearables, gaming systems, and even drones.\n\nCall center outsourcing\nOur US-based workforce supports major brands you work with every day, helping them grow revenue, reduce costs, and delight their customers.\nOur call center technical support services include presale and post-sale support. We deliver high-quality, turnkey solutions that bring programs to market under our customer’s brands. We excel at outsourcing customized solutions for businesses large and small, with a variety of pricing models to handle a wide range of requirements.\nWith our skilled workforce of expert, US-based tech support agents, signature self-service solutions, smart mobile support tools, and proven leadership in program design and execution, our clients:\n\n• Boost customer satisfaction scores to industry-leading levels\n• Deliver more value with products and warranty programs\n• Scale rapidly to add new products and services to their portfolio\n• Create new revenue streams by offering paid support to customers\n• Drive higher conversion rates with Support.com experts handling presale support\n\nCloud-based software\nOur call center services are powered by our own cloud-based technical support software tools that integrate with each other and our clients’ systems, such as CRM or ticketing apps, and other call center solutions. Support.com Cloud software and its sub-components are also licensed independently.\n\nWith Support.com Cloud, agents can see the whole picture and solve problems without tedious, repetitive questions. Customers can go to the web or use their mobile devices to get guided self-service or talk with agents by phone or chat. They can also show agents what they’re seeing by sharing photos or real-time videos using their mobile device camera. Rich analytics report on the complete customer experience in order to drive ongoing call center services innovation and deliver exceptional business outcomes.\n\nSupport.com’s signature Guided Paths® solution and experience-tested content library are the backbone of live agent and self-service solutions. Guided Paths turns the content library into step-by-step intelligence that increases first-contact resolution rates and delights customers. Using branching logic and dynamic decision points, it captures real-world best practices for simple to complex tasks — ensuring consistent delivery of the best, most efficient answers. The off-the-shelf content library includes guidance for over 10,000 devices and common problems, and we work with clients to build and customize content for their business.\n\nTechnical support\nSupport.com’s dedicated teams of US- and Philippine-based agents are available to help individuals and small businesses 24/7, 365 days a year by phone. They assist with installing, maintaining, and troubleshooting PCs and Macs, iOS and Android devices, and all the devices in the connected home.\n\nSupport.com’s subsidiary, RightHand IT, located in Louisville, Colorado, specializes in long-term management of IT infrastructure for local clients. RightHand IT provides day-to-day management of technology for small business, including computers, servers, routers, mobile devices, telephony, security, backup, and license management, plus helpdesk support for clients.\n\nDesktop software\nSupport.com’s SUPERAntiSpyware desktop software provides advanced scanning, detection, and removal tools to protect PCs from millions of malicious threats from malware, spyware, ransomware, trojans, keyloggers, and more. It’s the ideal complement to antivirus software, keeping PCs running smoothly.\n\nSupport.com’s Cosmos System Care desktop software keeps PCs secure, quick, and backed up. Twenty-four smart tools work together behind the scenes to optimize, clean, and repair a PC in real time. It strengthens security and privacy, backs up and recovers files, and optimizes disks, registries, Windows® settings, and more.\n\nMore about Support.com\nSupport.com is a US-based corporation, headquartered in Sunnyvale, CA. Its stock is traded on the NASDAQ under the symbol SPRT. Learn more about Support.com’s leadership team. – less",
          "_version_":1751911781456936960}]
    }}