{
    "responseHeader":{
      "status":0,
      "QTime":64,
      "params":{
        "q":"panic",
        "defType":"edismax",
        "indent":"true",
        "qf":"name industry description",
        "start":"0",
        "q.op":"OR",
        "_":"1670750314497"}},
    "response":{"numFound":1162,"start":0,"numFoundExact":true,"docs":[
        {
          "name":"The Counseling Center of Wayne and Holmes Counties",
          "rating":3.1,
          "reviews":11,
          "description":"The Counseling Center is a privately owned, not-for-profit community behavioral health agency. Our staff include psychiatrists, psychologists, social workers, counselors and psychiatric nurses. The Center if certified by the Ohio Dept. of Mental Health & Addiction Services, accredited by CARF, and supported, in part, by the Mental Health & Recovery Board of Wayne & Holmes Counties, Orrville United Way, United Way of Wayne & Holmes Counties, patient fees and grants. We provide an array of programs designed to treat mental and emotional problems in both children and adults, as well as rehabilitation services and prevention programs. Services are provided on a non-discriminatory basis and can be arranged by calling any one of our office locations. A sliding fee scale is available. Medicaid, Medicare and most private insurances are accepted. – less",
          "ratings.Management":2.2,
          "ratings.Culture":2.3,
          "headquarters":"2285 Benden Drive Wooster, OH 44691 In addition, we have satellite offices in Orrville, Rittman, and Millersburg. Coming soon - new location in Wadsworth.",
          "employees":4,
          "industry":"Nonprofit & NGO",
          "custom_rating":2.92,
          "ceo.count":0,
          "interview.count":0,
          "id":"a42b06fc-4bd1-441f-bd58-63f35aad867d",
          "ratings.Work_Life_Balance":3.5,
          "ratings.Compensation_Benefits":2.4,
          "ratings.Job_Security_Advancement":2.7,
          "_version_":1751910254472331264},
        {
          "name":"Epic Care",
          "rating":2.4,
          "reviews":41,
          "description":"Founded in the 1990’s, Epic Care is a group of board certified hematologists and oncologists based in the Northern East Bay area, dedicated to providing the newest breakthroughs and scientific innovations, as well as compassionate, trusting care. Since day one, we’ve strived to be more than just your specialist in your fight with cancer and blood disorders, we’ve strived to be your partner through it.\n\nThe lives we touch inspire us, so we pledge to do everything possible to make the unknown more manageable and comfortable to you. There’s no hiding it: illness and uncertainty can be frightening. We want to ensure that you get the exact treatment and support you need so you can conquer your fear when it hits hardest.\n\nYour health isn’t just a concern to you and us, but it’s a concern to your family, friends, and practitioners as well. Our ambition is to guide you through the process as seamlessly as possible, so we’ve aligned ourselves with the areas major medical providers and adapted our administration process to make paperwork as minimal as possible.\n\nDefining and providing you with the right treatment is a complex process, which is why we have a group of 30+ specialists working together to ensure that you receive the best possible care.\n\nFurthermore, Epic Care is the first facility in California to be Quality Oncology Practice Initiative (QOPI®) certified for Medical Oncology and accredited in Radiation Oncology and Diagnostic Radiology by the American College of Radiology (ACR).\n\nFrom the first diagnostic tests, treatment planning and administration, through the monitoring of treatment safety, effectiveness and outcome, we will support you with our professional expertise and personal compassion. We are your partners: the doctors, nurses, therapists and staff of Epic Care. – less",
          "happiness.Flexibility":3.1,
          "happiness.Achievement":2.95,
          "happiness.Purpose":2.95,
          "happiness.Learning":2.85,
          "happiness.Energy":2.85,
          "happiness.Appreciation":2.75,
          "happiness.Support":2.75,
          "happiness.Management":2.75,
          "happiness.Inclusion":2.65,
          "happiness.Compensation":2.45,
          "happiness.Trust":2.25,
          "happiness.Belonging":2.2,
          "ratings.Management":2.0,
          "ratings.Culture":2.5,
          "headquarters":"Antioch",
          "employees":4,
          "industry":"Healthcare",
          "revenue":3,
          "custom_rating":2.43,
          "ceo.count":14,
          "ceo.approval":71.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":21,
          "id":"cc5da215-3757-4745-9180-95d29cf943c4",
          "happiness.Work_Happiness_Score":2.75,
          "ratings.Work_Life_Balance":2.7,
          "ratings.Compensation_Benefits":2.1,
          "ratings.Job_Security_Advancement":2.2,
          "locations.Oakland__CA":3.7,
          "locations.Pleasant_Hill__CA":2.9,
          "locations.Emeryville__CA":2.2,
          "locations.Antioch__CA":1.9,
          "locations.Dublin__CA":1.7,
          "roles.Radiation_Therapist":3.3,
          "roles.Medical_Assistant":2.4,
          "roles.Medical_Receptionist":2.0,
          "roles.Laboratory_Assistant":1.0,
          "interview.experience_":["Favorable"],
          "_version_":1751910254828847104},
        {
          "name":"South Central Power Company",
          "rating":4.3,
          "reviews":6,
          "description":"South Central Power Company maintains over 12,000 miles of energized power lines that traverse 24 counties in Ohio. The Cooperative is a private enterprise owned and operated by the people it serves. The members elect an 11-member Board of Trustees that govern the co-op. The Board establishes policies, reviews co-op activities, and makes needed decisions. They hire a President and CEO who in turn hires a staff of employees to carry out the policies and operate and maintain the co-op’s lines and equipment.\n\nIn 1998, South Central Power Company became a Touchstone Energy Cooperative allowing us to be identified as part of a nationwide alliance of independently owned and operated electric cooperatives under a single brand identity. As a Touchstone Energy Cooperative, South Central Power Company has recommitted itself to principles we’ve operated under for years: integrity, accountability, innovation and community spirit.\n\nCooperatives of all types and sizes abide by seven unifying principles, which differentiate them from other types of companies. Those principles are: Voluntary & open membership, Democratic member control, Member economic participation, Autonomy and independence, Education, training and information, Cooperation among cooperatives, and Concern for community. – less",
          "ratings.Management":3.5,
          "ratings.Culture":3.7,
          "headquarters":"2780 Coonpath Rd NE Lancaster, OH 43130",
          "employees":5,
          "industry":"Energy, Mining & Utilities",
          "revenue":5,
          "custom_rating":4.25,
          "ceo.count":0,
          "interview.count":0,
          "id":"9f85ef0f-12bb-4611-bd1c-bb55cc1241cd",
          "ratings.Work_Life_Balance":4.7,
          "ratings.Compensation_Benefits":4.7,
          "ratings.Job_Security_Advancement":4.2,
          "_version_":1751910255036465152},
        {
          "name":"All Weather Seal of WM",
          "rating":3.9,
          "reviews":29,
          "description":"All Weather Seal of West Michigan is a 38 year-old family owned home improvement company located in west Michigan. We have 2 locations, one in the Grand Rapids, MI area and the other in Traverse City. We believe strongly in taking care of our employees and they will in turn take great care of our customers. We pride ourselves in providing extremely rewarding and lucrative employment opportunities with extensive training systems. Our #AWSCARES program enables our employees to take part in our continued commitment to giving back to the community. While many companies are extremely concerned with a certain level of experience, we have strong leadership and industry-leading trainers, so we are happy to offer employment to many candidates even with little to no experience in our industry. If you are able to meet our 4 h's: Honest, Hungry, Humble and Hone-able, we want to speak to you about a possible career opportunity. – less",
          "ratings.Management":4.0,
          "ratings.Culture":3.9,
          "headquarters":"319 E Main Lowell, MI 49331",
          "employees":4,
          "industry":"Construction & Facilities Services",
          "revenue":3,
          "custom_rating":3.87,
          "ceo.count":15,
          "ceo.approval":93.0,
          "interview.count":0,
          "id":"223cccf9-5bcd-44cb-a701-f4de28e88ddd",
          "ratings.Work_Life_Balance":3.7,
          "ratings.Compensation_Benefits":3.9,
          "ratings.Job_Security_Advancement":3.6,
          "salary.Data_Entry_Clerk":13.12,
          "salary.Outside_Sales_Representative":13.85,
          "salary.Sales_Professional":12.55,
          "_version_":1751910253538050048},
        {
          "name":"Dermalogica",
          "rating":3.9,
          "reviews":111,
          "description":"Whoever said beauty is only skin deep had the right idea, as far as Dermalogica is concerned. Founded by Jane Wurwand in 1986, Dermalogica continues to dominate the professional skin care industry with distribution in over 90 countries. Known worldwide as the Skin Therapist’s choice for offering the hottest, most respected professional skin care line, we are also recognized for our renowned postgraduate education - The International Dermal Institute (IDI) founded in 1983 by Jane Wurwand. With over 60 classes in skin, body, alternative therapy and business development, it is no surprise we are considered the industry leader. We offer the largest and best in class field sales team, along with the passion and commitment to ensure our customer’s success. We are an entrepreneurial company that fosters well-being, integrity and a hands-on environment. When Dermalogica meets skin, skin health is redefined. – less",
          "ratings.Management":3.6,
          "ratings.Culture":3.8,
          "headquarters":"1535 Beachey Pl Carson, CA 90746",
          "employees":5,
          "industry":"Manufacturing",
          "revenue":5,
          "custom_rating":3.81,
          "ceo.count":53,
          "ceo.approval":79.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About two weeks",
          "interview.count":15,
          "id":"d169bb3c-faf5-40f0-aa36-739412bec4dd",
          "ratings.Work_Life_Balance":3.8,
          "ratings.Compensation_Benefits":3.6,
          "ratings.Job_Security_Advancement":3.5,
          "locations.New_York__NY":4.3,
          "locations.Chicago__IL":3.7,
          "locations.Carson__CA":3.5,
          "roles.Account_Manager":4.7,
          "roles.Retail_Sales_Associate":4.2,
          "roles.Business_Consultant":3.6,
          "salary.Business_Consultant":6.91,
          "salary.Retail_Sales_Associate":4.2,
          "salary.Account_Manager":9.65,
          "interview.experience_":["Favorable"],
          "_version_":1751910254530002945},
        {
          "name":"Marathon Commerce, LLC.",
          "rating":5.0,
          "reviews":1,
          "description":"Marathon Commerce started in a utility closet with small volume sales. Within a year of operating, we reached seven figures as a small team and are continuing to push the boundaries of what hard work, coupled with innovative technology, can accomplish. Our goal is to provide a meaningful position in an inclusive and diverse workplace and we're always looking for dedicated team members! We're currently set in a 6000 sq.ft. warehouse. We work with student schedules as most of us are ESU students/alums and we're located a short distance from the main campus. Even if you don't see a job posting, feel free to reach out to our office admin, Katy Beatty, and she can fill you in on any upcoming opportunities. We also provide internship opportunities as we work hand-in-hand with the ESU business accelerator program!\nEmail kbeatty@marathon-studios.com with any inquires or concerns. – less",
          "headquarters":"Office (562 Independence Rd., Suite 204, East Stroudsburg, PA 18301) | Warehouse (107 Five Star Ln., River Rd. Entrance, East Stroudsburg, PA 18301)",
          "employees":2,
          "industry":"Consumer Goods and Services",
          "revenue":2,
          "custom_rating":5.0,
          "ceo.count":0,
          "interview.count":0,
          "id":"abab62ff-ce3e-4aa3-9efb-a10681d74037",
          "_version_":1751910252387762176},
        {
          "name":"Oswego County Opportunities, Inc.",
          "rating":2.5,
          "reviews":2,
          "description":"Oswego County Opportunities is a private, nonprofit human service agency serving 30,000 people each year through more than 50 programs providing:\n\n• Assistance for the homeless\n• Educational services\n• Health care for the whole family\n• Independence for the disabled\n• Meals for the elderly, disabled, & youth\n• Safety for the abused\n• Support for youth\n• Transportation for all\n\nOCO ranks among the top six largest private employers in Oswego County with over 550 employees and 1,200 volunteers. The agency is funded primarily by Federal and State dollars along with fee-for-service revenues and local support. OCO puts its money where its mission is: More than 90 cents of every dollar goes directly to program services.\n\nOswego County Opportunities is a United Way of Greater Oswego County member agency.\nOCO is a member of the New York State Community Action Association (NYSCAA). – less",
          "ratings.Management":2.5,
          "ratings.Culture":3.5,
          "headquarters":"239 Oneida Street Fulton, NY 13069",
          "employees":6,
          "industry":"Nonprofit & NGO",
          "custom_rating":2.39,
          "ceo.count":0,
          "interview.count":0,
          "id":"7c45e25f-645c-4ad9-80ab-c8d899d38eba",
          "ratings.Work_Life_Balance":2.0,
          "ratings.Compensation_Benefits":1.5,
          "ratings.Job_Security_Advancement":1.5,
          "_version_":1751910254447165440},
        {
          "name":"Benton County Oregon",
          "rating":3.2,
          "reviews":5,
          "description":"Our mission is making Benton County a better place to live. Benton County Government is bringing to its citizenry the authority, structure, and services to respond to public concerns and opportunities and to provide a means of local decision making. As an inclusive and diverse organization, Benton County's policy is to provide fair and equal treatment to all and to prohibit discrimination on the basis of race, color, religion, gender, national origin, disability, age, condition of pregnancy, sexual orientation, gender identity, military service, political affiliation, social-economic, marital status or affectional preferences.\n\nFor a complete listing of current job postings please visit: https://www.co.benton.or.us/hr/page/job-opportunities – less",
          "ratings.Management":3.4,
          "ratings.Culture":3.0,
          "headquarters":"Corvallis, Or",
          "employees":6,
          "industry":"Government & Public Administration",
          "custom_rating":3.17,
          "ceo.count":0,
          "interview.count":0,
          "id":"248d0ea4-50ab-42bd-8019-4661f1417bca",
          "ratings.Work_Life_Balance":3.2,
          "ratings.Compensation_Benefits":2.8,
          "ratings.Job_Security_Advancement":3.2,
          "salary.Human_Resources_Specialist":5.31,
          "salary.Coding_Specialist":5.69,
          "salary.Medical_Assistant":20.73,
          "_version_":1751910252882690048},
        {
          "name":"Great Wolf Lodge",
          "rating":3.5,
          "reviews":1500,
          "description":"Our 10,000+ Pack Members focus each and every day on \"Bringing Joy To Families.\"\n\nGreat Wolf Lodge provides an easy and unforgettable escape for families. Our lodges each feature a unique design. Extraordinary attractions and entertainment options sit side-by-side under one roof. Family time is easy with carefully crafted experiences. There's excitement outside of the water park, too. Get your wands at the ready with MagiQuest. The exclusive mystical interactive adventure game soars as one of our most popular activities. Discover many other engaging attractions. These include a ropes course, climbing wall, miniature golf, family bowling, arcade, and more. And kitchen facilities are completely nut-free to help put concerned parents at ease. Each night’s stay in our oversized family-friendly suites, grants two full days of unlimited access to the water park. A host of daily complimentary family events augments our exceptional value. Take the fun and creative class, Yoga Tails. Curl up for Story Time by the fireplace and engage in a high-energy dance party. The Great Wolf Kids characters meet and greet guests throughout the day.\n\nAt Great Wolf, our pack comes first and culture, training, career growth and benefits are core to our Pack Member Promise. Our Pack Member Promise is our commitment to each pack member ensuring your experience working with Great Wolf is the absolute best and that working with Great Wolf is more than a job…it’s a career, and sometimes, even a family. – less",
          "ratings.Management":3.0,
          "ratings.Culture":3.4,
          "roles.Baker":4.3,
          "salary.Lifeguard":11.52,
          "salary.Housekeeper":13.17,
          "salary.Attendant":11.55,
          "employees":8,
          "industry":"Hotels & Travel Accommodation",
          "custom_rating":3.39,
          "ceo.count":655,
          "ceo.approval":76.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":243,
          "id":"335018f3-18b2-4361-8862-ae5b9a6184fc",
          "ratings.Work_Life_Balance":3.3,
          "ratings.Compensation_Benefits":3.2,
          "ratings.Job_Security_Advancement":3.1,
          "locations.Sandusky__OH":4.0,
          "locations.Rochester__WA":3.9,
          "locations.Traverse_City__MI":3.8,
          "locations.Charlotte__NC":3.7,
          "roles.Shift_Leader":5.0,
          "roles.Nail_Technician":4.8,
          "roles.Front_Desk_Manager":4.5,
          "roles.Cashier_Sales":4.4,
          "interview.experience_":["Favorable"],
          "_version_":1751910252509396992},
        {
          "name":"Premier Home Health Care Services, Inc.",
          "rating":3.4,
          "reviews":273,
          "description":"Premier Home Healthcare is committed to delivering quality services and products. Our company's success will be attributed to our management and philosophy of putting the customer first and building in quality by providing the highest caliber of management expertise and attention. Clearly, no matter how \"good\" a service or product is, you would only consider it to be a quality service or product if it satisfies your needs and meets your expectations. At Premier Home Healthcare, customer satisfaction, quality control, and assurance are manifested as an integral part of management. Complete customer satisfaction is our goal. We strive to reach this goal by listening and remaining sensitive to our customer's needs, and providing the best service and products possible.\n\nACCOUNTS RECEIVABLE We have a professional staff of individuals to assist customers with any questions regarding their accounts. They can be reached during normal business working hours. Customer can be assured that their privacy will be of the utmost priority when discussing any claims and concerns. Customers can be confident that their best interest will be upheld as a result of the experience that Premier Home Healthcare has to offer.\n\nDELIVERY SERVICE We provide friendly and efficient delivery of equipment to our customers or equipment may be picked up at one of our locations. – less",
          "ratings.Management":3.2,
          "ratings.Culture":3.4,
          "roles.Receptionist":3.8,
          "headquarters":"White Plains",
          "employees":4,
          "industry":"Healthcare",
          "revenue":3,
          "custom_rating":3.33,
          "ceo.count":127,
          "ceo.approval":63.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":55,
          "id":"f7a651b0-0045-419d-9e98-14e722dc843b",
          "ratings.Work_Life_Balance":3.5,
          "ratings.Compensation_Benefits":3.0,
          "ratings.Job_Security_Advancement":3.0,
          "locations.Hickory__NC":5.0,
          "locations.Conover__NC":4.4,
          "locations.Hempstead__NY":4.3,
          "locations.Joliet__IL":4.3,
          "locations.Stamford__CT":4.0,
          "roles.Personal_Care_Assistant":4.3,
          "roles.Licensed_Practical_Nurse":4.2,
          "roles.Call_Center_Manager":4.0,
          "roles.Home_Care_Aide":4.0,
          "salary.Home_Health_Aide":10.21,
          "salary.Nursing_Assistant":11.96,
          "salary.Home_Care_Aide":10.63,
          "interview.experience_":["Favorable"],
          "_version_":1751910254323433472}]
    }}