{
    "responseHeader":{
      "status":0,
      "QTime":21,
      "params":{
        "q":"health manufacturing",
        "defType":"edismax",
        "indent":"true",
        "qf":"name industry description rating",
        "fl":"* score",
        "start":"0",
        "q.op":"AND",
        "rows":"10",
        "_":"1668268291347"}},
    "response":{"numFound":11,"start":0,"maxScore":3.535388,"numFoundExact":true,"docs":[
        {
          "name":"HSM Solutions",
          "rating":3.2,
          "reviews":168,
          "description":"HSM was founded in 1944 as Hickory Springs Manufacturing, a producer of coiled furniture springs. 76 years later, the private, family-owned company has evolved from a components supplier into a global manufacturer of integrated solutions and components to the furniture, bedding, transportation and a growing number of diversified markets. The forward-moving company is supported by approximately 2,500 employees in more than 30 manufacturing plants in 13 states and China.\n\nHSM offers a comprehensive benefits package including but not limited to:\n- PTO/Vacation\n- Affordable health insurance\n- Teladoc\n- Global health care options\n- Onsite clinics (dependent on facility location)\n- Dental insurance\n- Vision insurance\n- Life Insurance\n- Tuition reimbursement\n- 401(k)\n\nApply today to become a part of the HSM Family! – less",
          "happiness.Achievement":3.0,
          "happiness.Energy":2.95,
          "happiness.Appreciation":2.8,
          "happiness.Learning":2.7,
          "happiness.Support":2.65,
          "happiness.Flexibility":2.6,
          "happiness.Purpose":2.5,
          "happiness.Inclusion":2.5,
          "happiness.Compensation":2.4,
          "happiness.Trust":2.25,
          "happiness.Belonging":2.25,
          "happiness.Management":2.25,
          "ratings.Management":2.9,
          "ratings.Culture":3.0,
          "roles.Molder":3.5,
          "roles.Assembler":3.4,
          "salary.Assembler":10.98,
          "headquarters":"235 2nd Ave NW Hickory, NC",
          "employees":7,
          "industry":"Manufacturing",
          "custom_rating":3.02,
          "ceo.count":72,
          "ceo.approval":69.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":32,
          "id":"5573ac85-4608-4f72-8e86-885506b5d986",
          "happiness.Work_Happiness_Score":2.55,
          "ratings.Work_Life_Balance":3.1,
          "ratings.Compensation_Benefits":3.3,
          "ratings.Job_Security_Advancement":2.8,
          "locations.Lenoir__NC":3.7,
          "locations.Arlington__TX":3.4,
          "locations.Micaville__NC":3.3,
          "locations.Verona__MS":3.3,
          "locations.Fort_Valley__GA":3.3,
          "roles.Forklift_Operator":3.6,
          "roles.Truck_Driver":3.4,
          "roles.Maintenance_Person":2.5,
          "salary.Forklift_Operator":10.9,
          "salary.Machine_Operator":12.59,
          "interview.experience_":["Favorable"],
          "_version_":1751934940117729280,
          "score":3.535388},
        {
          "name":"Thorne Research",
          "rating":3.2,
          "reviews":51,
          "description":"For over 30 years, Thorne Research has set the standard for exceptional quality manufacturing and formulation of premium natural dietary supplements. Thorne's dietary supplements are recognized by health care practitioners around the world as being the finest, purest, highest quality dietary supplements available. Located in Summerville, SC, Thorne operates a state-of-the-art manufacturing facility, employing over 350 people. Our complete line of over 300 products is available through licensed health care practitioners and at select independent pharmacies and other distribution outlets.\nMission: Enhancing the health and well-being of people worldwide by providing high-quality, research-based nutritional supplements, health diagnostics, technology platforms, and education.\nThrough innovative, science-based products and services, a passionate, talented team, collaboration with diverse strategic partners and customers, and through an unwavering commitment to integrity, Thorne Research strives to become the leading lifestyle-management company in the world. – less",
          "happiness.Compensation":3.6,
          "happiness.Learning":3.5,
          "happiness.Flexibility":3.45,
          "happiness.Achievement":3.4,
          "happiness.Appreciation":3.15,
          "happiness.Purpose":3.05,
          "happiness.Energy":2.95,
          "happiness.Inclusion":2.95,
          "happiness.Support":2.85,
          "happiness.Belonging":2.7,
          "happiness.Management":2.6,
          "happiness.Trust":2.45,
          "ratings.Management":2.8,
          "ratings.Culture":2.9,
          "headquarters":"Summerville, South Carolina",
          "employees":5,
          "industry":"Healthcare",
          "revenue":5,
          "custom_rating":3.13,
          "ceo.count":29,
          "ceo.approval":62.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":21,
          "id":"d689d6ff-fc80-4041-bc99-917d055bb3fd",
          "happiness.Work_Happiness_Score":3.05,
          "ratings.Work_Life_Balance":3.3,
          "ratings.Compensation_Benefits":3.6,
          "ratings.Job_Security_Advancement":2.8,
          "interview.experience_":["Favorable"],
          "_version_":1751934939460272128,
          "score":3.4783082},
        {
          "name":"Elevate Health Sciences",
          "rating":1.8,
          "reviews":4,
          "description":"Elevate Health Sciences (EHS) is a contract manufacturer of softgel and two-piece capsule dietary supplements. EHS has a new, state-of-the art facility in Provo, Utah to be completed Spring 2016. EHS is dedicated to producing the highest quality dietary supplements. Each step, from selection of raw materials through manufacturing and packaging, is controlled and monitored for compliance to Good Manufacturing Practices and highest quality standards. EHS has built a team of industry experts that are dedicated to the future of this new company. EHS is seeking honest, hard-working applicants that have a desire to contribute to the growth of the company. – less",
          "ratings.Management":1.0,
          "ratings.Culture":1.3,
          "headquarters":"Provo",
          "employees":3,
          "industry":"Manufacturing",
          "custom_rating":1.54,
          "ceo.count":0,
          "interview.count":0,
          "id":"cd576a81-1ac1-436e-9060-6b710364069d",
          "ratings.Work_Life_Balance":1.3,
          "ratings.Compensation_Benefits":1.0,
          "ratings.Job_Security_Advancement":1.0,
          "_version_":1751934939481243648,
          "score":3.4288492},
        {
          "name":"AMEA Healthcare",
          "rating":3.9,
          "reviews":15,
          "description":"Custom Staffing is a large, regional employment agency operating throughout West Central Ohio. The majority of our business is manufacturing, warehousing and skilled/unskilled production labor.\n\nIn addition to our large industrial staffing base, we have been providing skilled medical care in nursing homes, hospitals, doctor’s offices and manufacturing facilities since 1990. In 2003, we became PASSPORT certified and have been providing personal care and homemaking services for geriatric consumers.\n\nIn August 2012, AMEA Healthcare was formed to absorb all of the medical business from Custom Staffing to become a stand-alone healthcare company. Currently, we are providing home health services (personal care and homemaker care) and nursing facility staffing services.\n\nAMEA Healthcare will allow the medical side of our business to grow without the confusion of being associated with an industrial staffing company. To the public, there will not be a connection between the two companies. AMEA Healthcare can be seen on the internet here:\n\nwww.ameahealthcare.com\n\nThe employees and policies that have proven to be successful for Custom Staffing will also transfer to AMEA Healthcare. To our existing consumers, it will be a simple name change; to the public, it will be an entirely new healthcare company. – less",
          "ratings.Management":3.9,
          "ratings.Culture":3.9,
          "employees":2,
          "industry":"Healthcare",
          "custom_rating":3.77,
          "ceo.count":0,
          "interview.difficulty":"Easy",
          "interview.count":5,
          "id":"30ab9338-b5e5-4076-8749-45e45f4fe07a",
          "ratings.Work_Life_Balance":3.9,
          "ratings.Compensation_Benefits":2.9,
          "ratings.Job_Security_Advancement":3.1,
          "salary.State_Tested_Nursing_Assistant":11.92,
          "salary.Home_Health_Aide":10.8,
          "salary.Licensed_Practical_Nurse":26.02,
          "interview.experience_":["Favorable"],
          "_version_":1751934941494509568,
          "score":3.2116048},
        {
          "name":"U.S. Cotton, LLC",
          "rating":3.4,
          "reviews":176,
          "description":"Founded in 1983, U.S. Cotton is the leading manufacturer of cotton products in the Americas and the only major national manufacturer of organic cotton products. With over 35 years of experience in all cotton categories, we hold the number one position in the market for health and beauty aid cotton products.\n\nWe take our benefit programs seriously. Not only do we try to provide you with quality benefit options but we also absorb a large portion of the cost for many of the benefits. In fact, many of our benefits are offered at no cost to you!\n\nU.S. Cotton’s outstanding benefits, including:\n• Medical and Prescription\n• Vision\n• Dental\n• Flexible Spending Accounts\n• Short-Term Disability (STD)\n• Long-Term Disability (LTD)\n• Basic Life and AD&D\n• Supplemental Life and AD&D\n• Dependent Life\n• 401(k)\n• Other voluntary benefits\n• MyADP (Employee Self-service App.)\n• Employee Assistance Program\n• Paid Vacation\n• Paid Holidays\n• Paid Sick (Salaried)\n• Tuition Assistance\n• Apprenticeship Program (Hourly Maintenance)\n• Issued Uniforms (Hourly Maintenance)\n• Safety Glasses Program\n• Safety Boot Program (Specific positions)\n\nU.S. Cotton is an Equal Employment Opportunity/Affirmative Action employer. – less",
          "happiness.Achievement":3.25,
          "happiness.Learning":3.15,
          "happiness.Energy":3.1,
          "happiness.Purpose":3.05,
          "happiness.Flexibility":3.0,
          "happiness.Appreciation":2.95,
          "happiness.Support":2.8,
          "happiness.Compensation":2.75,
          "happiness.Belonging":2.6,
          "happiness.Inclusion":2.45,
          "happiness.Trust":2.45,
          "happiness.Management":2.4,
          "ratings.Management":3.1,
          "ratings.Culture":3.3,
          "roles.Mechanic":4.8,
          "roles.Assembler":4.0,
          "headquarters":"Gastonia",
          "employees":6,
          "industry":"Manufacturing",
          "revenue":5,
          "custom_rating":3.24,
          "ceo.count":70,
          "ceo.approval":76.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":31,
          "id":"9230fbb2-9f39-46b2-90ce-a0d34694a74e",
          "happiness.Work_Happiness_Score":2.7,
          "ratings.Work_Life_Balance":3.2,
          "ratings.Compensation_Benefits":3.3,
          "ratings.Job_Security_Advancement":3.3,
          "locations.Rio_Rancho__NM":3.4,
          "locations.Cleveland__OH":3.2,
          "locations.Albuquerque__NM":2.4,
          "roles.Warehouse_Worker":4.0,
          "roles.Maintenance_Mechanic":3.7,
          "roles.Utility_Worker":3.3,
          "salary.Machine_Operator":11.12,
          "salary.Warehouse_Worker":11.18,
          "salary.Material_Handler":11.65,
          "interview.experience_":["Favorable"],
          "_version_":1751934940765749248,
          "score":3.1960855},
        {
          "name":"Numed",
          "reviews":0,
          "description":"Numed has been in business since 2013, offering the highest quality of pharmaceuticals at the lowest prices.\nWorking together with various manufacturers, Numed carries over 3,000 diverse products, with market's trends in mind.\nGeneric, branded and over the counter items are our specialties.\nProud of our accurate and quick fulfillment of their orders, Numed has grown exponentially in the last couple of years, with over 400% growth in the last year alone.\nOur customers include pharmacies - independent and chain - hospitals, long term health care facilities and government agencies. – less",
          "headquarters":"2004 McDonald Ave Brooklyn,NY 11223",
          "employees":3,
          "industry":"Pharmaceutical & Biotechnology",
          "revenue":4,
          "ceo.count":0,
          "interview.count":0,
          "id":"fdf15cb5-92ca-4940-8796-5d4e47e60e64",
          "_version_":1751934940416573441,
          "score":3.0643947},
        {
          "name":"NIC Global",
          "rating":3.5,
          "reviews":36,
          "description":"NIC Global is a leading manufacturer of sheet metal and mechanical assemblies. Our US plants are in Woodinville, WA; Gallatin, TN; Chillicothe, OH; and Denton TX. NIC Global does more than build quality products. We focus on creating and fostering a corporate culture where all our employees are part of a rewarding team. Providing a safe and healthy working environment is a baseline. We also take pride in our respectful approach to communicating with and supporting our team members. NIC Global is an Equal Opportunity Employer that offers a competitive compensation and benefits package which includes health and dental insurance, 401(k) matching plan, and tuition reimbursement. – less",
          "ratings.Management":3.1,
          "ratings.Culture":3.5,
          "roles.Assembler":2.6,
          "salary.Assembler":15.58,
          "headquarters":"Corporate Headquarters: 23518 63rd Ave SE Woodinville, WA 98072",
          "employees":6,
          "industry":"Manufacturing",
          "revenue":5,
          "custom_rating":3.41,
          "ceo.count":14,
          "ceo.approval":86.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":7,
          "id":"7273a369-b20a-4453-ac72-b6f6eeb79081",
          "ratings.Work_Life_Balance":3.6,
          "ratings.Compensation_Benefits":3.3,
          "ratings.Job_Security_Advancement":2.8,
          "locations.Denton__TX":4.3,
          "locations.Gallatin__TN":4.0,
          "locations.Chillicothe__OH":3.0,
          "locations.Woodinville__WA":3.0,
          "roles.Shipping_and_Receiving_Clerk":4.3,
          "roles.Machine_Operator":4.0,
          "salary.Machine_Operator":16.78,
          "salary.Press_Brake_Operator":17.49,
          "interview.experience_":["Favorable"],
          "_version_":1751934940912549888,
          "score":3.0431492},
        {
          "name":"Marshall & Sterling Insurance",
          "rating":3.6,
          "reviews":20,
          "description":"Since 1864, Marshall & Sterling Insurance has been the name synonymous with outstanding insurance coverage and customer service. Marshall & Sterling provides exceptional insurance coverage with unparalleled service and support for our valued clients.\n\nAs an employee-owned company, our experienced insurance professionals can assist with virtually any insurance need. Our pride in ownership drives us to be an insurance agency unlike any other.\n\nBuying the best insurance these days can be perilous at best. Whether it’s an obscure 800 number, or an unknown website you’ve happen to Google, how do you know you’re getting the best possible protection with the best rates?\n\n\nWe are one of the nation's largest independent agencies....\n\nAs one of the largest independent insurance agencies in the nation, Marshall & Sterling Insurance provides affordable auto, home, life, health and business insurance coverage.\n\nMarshall & Sterling has the industry expertise, attentive care and support each customer deserves. We are committed to exceeding each and every client’s expectation for quality insurance and customer service.\n\nMarshall & Sterling is a leading broker of all lines of insurance for varied industries, specializing in retail and wholesale businesses, as well as service industries, public entities, schools, the hospitality industry, manufacturers, professional, directors’ and officers’ liability, health care, construction, specialty risks, workers’ compensation and performance, fidelity and fiduciary.\n\nWe have direct and preferred relationships with leading insurance carriers, providing our business and personal insurance clients with a broad array of competitive choices.\n\nIn addition, Marshall & Sterling provides group health, life and ancillary employee benefit programs to both large and small companies.\n\n\nWe provide you choice and expertise....\n\nRegardless of size, whether you represent a large multi-national corporation, or you’re an individual seeking home or auto insurance, Marshall & Sterling is your first choice to find the right insurance protection at the right price. The broad array of insurance carriers represented by Marshall & Sterling Insurance ensures that each account is afforded excellent coverage. Our breadth of experience and knowledge provides our clients with virtually all forms of insurance, tailored to meet your unique, diverse and particular needs.\n\nMarshall & Sterling has been recognized nationally for outstanding service, support and best practices. The company maintains a national presence, is licensed in all states and the U.S. Virgin Islands, and is well positioned to serve the requirements of international clients.\n\n◾Business Insurance\n◾Property & Casualty\n◾General & Excess Liability\n◾D&O and E&O\n◾Inland Marine\n◾Fleet Truck & Auto\n◾Heavy Equipment\n◾Workers’ Compensation\n◾Bonds & Specialty Risks\n◾Loss Control and Risk Management Services – less",
          "ratings.Management":2.9,
          "ratings.Culture":3.2,
          "headquarters":"Poughkeepsie",
          "employees":5,
          "industry":"Insurance",
          "revenue":5,
          "custom_rating":3.44,
          "ceo.count":0,
          "interview.count":0,
          "id":"2dff7f9b-d6ac-436c-96e9-bb9034c67b32",
          "ratings.Work_Life_Balance":3.4,
          "ratings.Compensation_Benefits":3.6,
          "ratings.Job_Security_Advancement":2.7,
          "_version_":1751934940849635328,
          "score":2.842846},
        {
          "name":"Chobani",
          "rating":3.7,
          "reviews":217,
          "description":"Since our founding 10 years ago, we’ve always been a different kind of company. After moving to New York from his native Turkey, our CEO Hamdi Ulukaya thought everyone deserved better options, so he set about making delicious, nutritious, natural, and accessible Greek Yogurt right here in the U.S.\n\nOur mission since day one has been to provide better food to more people. And now as the No. 1-selling Greek Yogurt brand in America and the second largest overall yogurt manufacturer, we believe every food maker has a responsibility to provide people with better options, which is why we’re so proud of the way our food is made.\n\nFrom the very first batch that came off the line in Upstate New York, in 2007, our cups have been crafted using only natural, non-GMO ingredients. We refuse to use any preservatives. Our yogurt contains no artificial flavors, artificial sweeteners, or preservatives.\n\nIt has been a busy 10 years for Chobani. Along our journey, we’ve constantly innovated our offerings to evolve with customer tastes and preferences, leading with values, and putting our people first.\n\nAs we look to the future, Chobani is reinvigorating its founding mission with a vision to make universal wellness happen sooner using food as a force of good.\n\nOur vision builds on the company's founding mission to provide better food for more people, while laying out how Chobani is defining wellness and where the brand will invest to achieve it:\n• Nutritional Wellness: Scaling our efforts to provide better food for more people.\n• Social Wellness: Increasing our investment in the communities we serve and the people who craft our food.\n• Environmental Wellness: Building a supply chain that ensures the planet's health.\n\nThis evolution supports Chobani’s ambition to become a food-focused wellness company and providing better food to all people. – less",
          "happiness.Flexibility":3.4,
          "happiness.Achievement":3.25,
          "happiness.Compensation":3.25,
          "happiness.Learning":3.2,
          "happiness.Energy":3.05,
          "happiness.Purpose":3.05,
          "happiness.Appreciation":3.05,
          "happiness.Support":2.9,
          "happiness.Belonging":2.9,
          "happiness.Inclusion":2.85,
          "happiness.Management":2.85,
          "happiness.Trust":2.75,
          "ratings.Management":3.0,
          "ratings.Culture":3.6,
          "roles.Laborer":4.4,
          "roles.Packager":4.1,
          "salary.Operator":5.49,
          "headquarters":"Norwich, New York",
          "employees":7,
          "industry":"Consumer Goods and Services",
          "revenue":6,
          "custom_rating":3.49,
          "ceo.count":99,
          "ceo.approval":89.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":22,
          "id":"6d67efef-2956-4d47-8c89-15e1db4bea88",
          "happiness.Work_Happiness_Score":3.25,
          "ratings.Work_Life_Balance":3.5,
          "ratings.Compensation_Benefits":3.8,
          "ratings.Job_Security_Advancement":3.2,
          "locations.New_York__NY":4.0,
          "locations.Norwich__NY":3.9,
          "locations.New_Berlin__NY":3.7,
          "locations.Twin_Falls__ID":3.6,
          "roles.Packaging_Operator":4.7,
          "roles.Filler_Operator":4.5,
          "roles.Warehouse_Worker":4.3,
          "salary.Forklift_Operator":5.27,
          "salary.Machine_Operator":14.38,
          "interview.experience_":["Favorable"],
          "_version_":1751934940275015680,
          "score":2.766821},
        {
          "name":"Magnum Electric Inc",
          "rating":3.7,
          "reviews":12,
          "description":"Magnum Electric is a distinguished leader in the local electrical contracting industry. Our team consistently provides outstanding customer service and quality products to our customers. Being in business for over 25 Years performing work across North Dakota, Minnesota, South Dakota, and Montana, Magnum Electric has built a solid reputation for quality workmanship, and has successfully completed numerous projects installing equipment and wiring high-profile commercial properties, industrial office developments, and residential homes throughout the region. What sets Magnum Electric apart is our commitment to quality workmanship, an experienced team of knowledgeable electricians, and our design/build professionals. At Magnum Electric we pride ourselves in that we are family-oriented and with our current and future growth, our employees will not be treated as “just a number” but as a strongly valued asset in our company.\n\nWhat we ask of our Applicants:\n* Solid work ethic, team player attitude, and problem solving ability\n* Own personal hand tools\n* Must be able to pass a pre-employment drug screen and background check\n* Must be able to use hand tools required\n* Ability to work overhead\n* Ability to work at heights\n* Ability to lift +50 pounds\n* Ability to work indoors, outdoors, and occasionally in inclement weather\n* Ability to safely use and climb ladders\n* A drive to become the future of our company\n\nWhat we give to our employees:\n* +40 hour weeks and year round work\n* Flexible work schedules\n* Diverse projects ranging from large 400-unit apartment complexes; to working in hospitals, prisons, schools, banks, restaurants and more; to working on very detail-orientated installs for large industrial equipment and manufacturing facilities\n* Health / Dental / Vision Insurance within 3 months of hire\n* 2 weeks of paid vacation time that starts building after 30 days of hire\n* Paid Holidays\n* 401k Retirement with company paid matching\n* Supplemental Aflac insurance\n* The ability to further your own career towards attaining a Journeyman’s License, and eventually running your own crew in a company truck, or stepping into an office position\n\nWe have open positions in Fargo ND, Detroit Lakes MN, Bismarck ND, Dickinson ND, as well as traveling positions into Western ND and the oil patch.\n\nWe have the options. Just tell us what you’re interested in! – less",
          "ratings.Management":3.3,
          "ratings.Culture":3.3,
          "salary.Electrician":38.34,
          "headquarters":"471 Christianson Dr. W, West Fargo, ND 58078",
          "employees":5,
          "industry":"Construction & Facilities Services",
          "revenue":4,
          "custom_rating":3.62,
          "ceo.count":0,
          "interview.count":0,
          "id":"f88dddab-ef97-4f47-9051-1fd3c397ddd6",
          "ratings.Work_Life_Balance":3.4,
          "ratings.Compensation_Benefits":3.9,
          "ratings.Job_Security_Advancement":3.5,
          "salary.Apprentice_Electrician":18.03,
          "salary.Journeyman_Electrician":29.73,
          "_version_":1751934939641675776,
          "score":2.6673589}]
    }}