{
  "responseHeader":{
    "status":0,
    "QTime":1,
    "params":{
      "q":"Sport",
      "defType":"edismax",
      "indent":"true",
      "qf":"name",
      "start":"0",
      "q.op":"OR",
      "_":"1668355769457"}},
  "response":{"numFound":1,"start":0,"numFoundExact":true,"docs":[
      {
        "name":"Sport Clips",
        "rating":3.6,
        "reviews":1800,
        "description":"Headquartered in Georgetown, Texas, Sport Clips Haircuts is a sports-themed hair-care franchise for men and boys with more than 1750+ stores across the United States and Canada. Established in 1993 and franchised in 1995 by Gordon Logan, founder and CEO, the company is one of the nation’s leading franchises. The franchise is ranked in the Top 10 in the annual overall Entrepreneur 500 ranking and 22nd for its \"exceptional growth,\" having opened 136 stores in 2017.\n\nFounder and CEO Gordon Logan is a pioneer of the unique sports-themed haircutting franchise, including the development of the Sport Clips All-Star haircutting systems, operating procedures, and marketing programs.\n\nSport Clips is not only the first sports-themed hair salon franchise formed, but it is the only one listed in the Entrepreneur Magazine’s annual “Franchise 500” ranking.\n\nDesigned to target a previously underserved market in a multi billion dollar industry, Sport Clips caters to men and boys by providing hassle-free hairstyling in a unique, sports-themed environment.\n\nQualified veterans who are interested in owning a Sport Clips are eligible for a 20 percent discount off of Sport Clips’ franchise fee of $59,500 through participation in the Veterans Transition Franchise Initiative, also known as VetFran, which was created in 1991 during the Gulf War.\n\nSince 2013, Sport Clips has been the primary supporter of the VFW’s Sport Clips Help A Hero Scholarship program, which provides scholarships for service members and veterans for use of a post-secondary schools and trade schools. To date, we have awarded 943 scholarships totaling $4.1 million. By providing scholarships for use at post-secondary schools, including trade schools, our goal is to make the transition from a military career to the civilian workforce a little easier. – less",
        "happiness.Achievement":3.3,
        "happiness.Purpose":3.2,
        "happiness.Support":3.15,
        "happiness.Energy":3.15,
        "happiness.Learning":3.15,
        "happiness.Appreciation":3.1,
        "happiness.Flexibility":3.05,
        "happiness.Compensation":2.95,
        "happiness.Inclusion":2.9,
        "happiness.Management":2.85,
        "happiness.Trust":2.8,
        "happiness.Belonging":2.8,
        "ratings.Management":3.3,
        "ratings.Culture":3.5,
        "salary.Stylist":15.64,
        "salary.Cosmetologist":15.28,
        "headquarters":"100 Briarwood Drive Georgetown, Texas 78628",
        "employees":9,
        "industry":"Consumer Goods and Services",
        "revenue":3,
        "custom_rating":3.38,
        "ceo.count":748,
        "ceo.approval":80.0,
        "interview.difficulty":"Easy",
        "interview.duration":"About a day or two",
        "interview.count":295,
        "id":"77b84a36-1c48-4588-92d4-80c53965f134",
        "happiness.Work_Happiness_Score":3.0,
        "ratings.Work_Life_Balance":3.3,
        "ratings.Compensation_Benefits":3.0,
        "ratings.Job_Security_Advancement":3.2,
        "locations.Lubbock__TX":5.0,
        "locations.Milford__MA":5.0,
        "locations.Morgantown__WV":5.0,
        "locations.Northborough__MA":5.0,
        "locations.Collinsville__IL":5.0,
        "roles.Area_Coach":5.0,
        "roles.ASSISTANT_MANAGER":5.0,
        "roles.Area_Leader":4.7,
        "roles.Asst._Manager":4.7,
        "roles.Customer_Service_Representative":4.7,
        "salary.Hair_Stylist":2.6,
        "interview.experience_":["Favorable"],
        "_version_":1751934939409940480}]
  }}