{
    "responseHeader":{
      "status":0,
      "QTime":2,
      "params":{
        "q":"Sport~1",
        "defType":"edismax",
        "indent":"true",
        "qf":"name",
        "start":"0",
        "q.op":"OR",
        "_":"1668355769457"}},
    "response":{"numFound":5,"start":0,"numFoundExact":true,"docs":[
        {
          "name":"Sport Clips",
          "rating":3.6,
          "reviews":1800,
          "description":"Headquartered in Georgetown, Texas, Sport Clips Haircuts is a sports-themed hair-care franchise for men and boys with more than 1750+ stores across the United States and Canada. Established in 1993 and franchised in 1995 by Gordon Logan, founder and CEO, the company is one of the nation’s leading franchises. The franchise is ranked in the Top 10 in the annual overall Entrepreneur 500 ranking and 22nd for its \"exceptional growth,\" having opened 136 stores in 2017.\n\nFounder and CEO Gordon Logan is a pioneer of the unique sports-themed haircutting franchise, including the development of the Sport Clips All-Star haircutting systems, operating procedures, and marketing programs.\n\nSport Clips is not only the first sports-themed hair salon franchise formed, but it is the only one listed in the Entrepreneur Magazine’s annual “Franchise 500” ranking.\n\nDesigned to target a previously underserved market in a multi billion dollar industry, Sport Clips caters to men and boys by providing hassle-free hairstyling in a unique, sports-themed environment.\n\nQualified veterans who are interested in owning a Sport Clips are eligible for a 20 percent discount off of Sport Clips’ franchise fee of $59,500 through participation in the Veterans Transition Franchise Initiative, also known as VetFran, which was created in 1991 during the Gulf War.\n\nSince 2013, Sport Clips has been the primary supporter of the VFW’s Sport Clips Help A Hero Scholarship program, which provides scholarships for service members and veterans for use of a post-secondary schools and trade schools. To date, we have awarded 943 scholarships totaling $4.1 million. By providing scholarships for use at post-secondary schools, including trade schools, our goal is to make the transition from a military career to the civilian workforce a little easier. – less",
          "happiness.Achievement":3.3,
          "happiness.Purpose":3.2,
          "happiness.Support":3.15,
          "happiness.Energy":3.15,
          "happiness.Learning":3.15,
          "happiness.Appreciation":3.1,
          "happiness.Flexibility":3.05,
          "happiness.Compensation":2.95,
          "happiness.Inclusion":2.9,
          "happiness.Management":2.85,
          "happiness.Trust":2.8,
          "happiness.Belonging":2.8,
          "ratings.Management":3.3,
          "ratings.Culture":3.5,
          "salary.Stylist":15.64,
          "salary.Cosmetologist":15.28,
          "headquarters":"100 Briarwood Drive Georgetown, Texas 78628",
          "employees":9,
          "industry":"Consumer Goods and Services",
          "revenue":3,
          "custom_rating":3.38,
          "ceo.count":748,
          "ceo.approval":80.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":295,
          "id":"77b84a36-1c48-4588-92d4-80c53965f134",
          "happiness.Work_Happiness_Score":3.0,
          "ratings.Work_Life_Balance":3.3,
          "ratings.Compensation_Benefits":3.0,
          "ratings.Job_Security_Advancement":3.2,
          "locations.Lubbock__TX":5.0,
          "locations.Milford__MA":5.0,
          "locations.Morgantown__WV":5.0,
          "locations.Northborough__MA":5.0,
          "locations.Collinsville__IL":5.0,
          "roles.Area_Coach":5.0,
          "roles.ASSISTANT_MANAGER":5.0,
          "roles.Area_Leader":4.7,
          "roles.Asst._Manager":4.7,
          "roles.Customer_Service_Representative":4.7,
          "salary.Hair_Stylist":2.6,
          "interview.experience_":["Favorable"],
          "_version_":1751934939409940480},
        {
          "name":"Riddell Sports",
          "rating":3.5,
          "reviews":41,
          "description":"About Riddell\n\nRiddell is a premier designer and developer of protective sports equipment, apparel and related products, as well as the leading provider of reconditioning services for athletic gear. Since 1929, Riddell has continually brought to market products that address the evolving needs of the athlete. Riddell has a long and storied history of innovation when it comes to sports equipment. John Tate Riddell started this company with a simple but brilliant idea to make sporting equipment safer, better, and easier to use for athletes. Many years, and hundreds of great ideas later, we’re still sporting better by making better equipment. It all started with the removable cleat, the brainchild of Riddell who at the time was the Head Football Coach and Athletic Director of Evanston Township High School.\n\nThis innovation was just one of many Riddell “firsts” that revolutionized the sporting equipment landscape. In 1939, Riddell had another breakthrough. He invented and perfected the first plastic suspension helmet. Invented for the football field, the United States Government quickly saw its benefit for protecting troops in World player from young men all the way up to NFL professionals.War II. Today, Riddell equipment is seen on football fields from coast-to- coast.\n\nOur equipment is also prominently seen on baseball and softball fields, basketball and volleyball courts, lacrosse and soccer fields, and in track and field events. Why? It’s simple. With a proven commitment to creating the best sporting equipment, it’s tough to beat Riddell. – less",
          "ratings.Management":3.1,
          "ratings.Culture":3.5,
          "roles.Assembler":3.3,
          "roles.Laborer":2.3,
          "salary.Sander":12.56,
          "salary.Assembler":12.54,
          "headquarters":"Headquarters 1700 West Higgins Road Suite #500 Des Plaines, IL 60018",
          "employees":7,
          "industry":"Consumer Goods and Services",
          "custom_rating":3.39,
          "ceo.count":22,
          "ceo.approval":73.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":8,
          "id":"6cc32a52-c343-4fc3-b82b-b689d9f55395",
          "ratings.Work_Life_Balance":3.2,
          "ratings.Compensation_Benefits":3.3,
          "ratings.Job_Security_Advancement":2.9,
          "locations.East_Stroudsburg__PA":3.8,
          "locations.Elyria__OH":3.7,
          "locations.North_Ridgeville__OH":2.9,
          "roles.Sales_Representative":4.3,
          "salary.Machine_Operator":13.53,
          "interview.experience_":["Favorable"],
          "_version_":1751934940448030720},
        {
          "name":"Dunham's Sports",
          "rating":3.2,
          "reviews":492,
          "description":"Dunham's Sports, one of the largest full-line sporting goods chains in the U.S., was founded in 1937 as Dunham's Bait & Tackle. We got our start in Waterford, Michigan, just outside Detroit, and today we have our corporate home in Troy, Michigan.\n\nNow we've grown into a complete sports outfitter serving customers in over 20 states, with over 230 stores. We continue to open Dunham's Sports stores in new and established markets.\n\nDunham's has built its reputation on selection, quality and value: unsurpassed choice of national brands at low prices...every day. Every one of our more than 230 stores offers a complete line of sporting goods, athletic equipment, active sports gear and leisure apparel.\n________________________________________\nPhilosophy\nOur motto at Dunham’s Sports is Big Names…Low Prices. Every day we give our customers the choice of the name brands they want, at the lowest prices possible. We stock a remarkable range of popular national brands, while our immense buying power makes it possible for us to combine value and quality in everything we sell. You will notice this in every Dunham’s Sports store you go into where you will find Hot Deals and Sport Values at prices that may be too low to advertise.\nSo the next time you’re thinking sports…\nGet in the game at Dunham’s Sports, where our big names bring you in and our low prices bring you back!\n________________________________________\nBenefits\nBenefits available for all Associates:\nMerchandise discount\nFlexible scheduling\n\nBenefits available based on position and meeting required waiting periods and minimum hours:\n401(k)\nHealth, Dental and Vision coverage\nLife insurance\nDisability coverage\nPrescription plan\nVacation Days\n________________________________________\nCulture\nWhether you are looking for a career in retailing or a position to earn some extra spending money, Dunham's offers many opportunities in our stores, distribution center and corporate office. We attract enthusiastic, fun-loving, sports minded individuals that like variety in their job. Do you love to talk sports? If so, we may have the perfect opportunity for you.\n________________________________________\n\nCareer Opportunities\n\nStores\nThe following store positions may be available in the location nearest you:\n\nGeneral Manager\nTeam Manager\nKey Team Leader\nTeam Coordinator\nTeam Member/Cashier\nSeasonal positions\n\nDistribution Center\nThe following positions may be available in our Distribution Center located in Marion, IN:\n\nShipping\nProcessing\nOTR Driver\nClerical\nSeasonal positions\n\nCorporate Office\nThe following positions may be available in our Corporate Office located in Troy, MI:\n\nAccounting/Finance\nAdvertising\nHR/Payroll\nLegal/Real Estate\nConstruction\nLoss Prevention\nMerchandising (buying)\nMerchandise Planning\nStore Operations\nInformation Technology – less",
          "happiness.Flexibility":3.35,
          "happiness.Achievement":3.3,
          "happiness.Support":3.0,
          "happiness.Appreciation":3.0,
          "happiness.Purpose":2.9,
          "happiness.Learning":2.85,
          "happiness.Energy":2.85,
          "happiness.Inclusion":2.8,
          "happiness.Management":2.75,
          "happiness.Trust":2.65,
          "happiness.Belonging":2.5,
          "happiness.Compensation":2.45,
          "ratings.Management":3.0,
          "ratings.Culture":3.0,
          "roles.Stocker":4.0,
          "salary.Cashier":7.96,
          "headquarters":"5607 New King Drive Ste 125 Troy, MI",
          "employees":7,
          "industry":"Retail & Wholesale",
          "revenue":5,
          "custom_rating":3.04,
          "ceo.count":209,
          "ceo.approval":59.0,
          "interview.difficulty":"Easy",
          "interview.duration":"About a day or two",
          "interview.count":96,
          "id":"c47656ab-394d-4424-8911-6d5e0aef90bf",
          "happiness.Work_Happiness_Score":2.95,
          "ratings.Work_Life_Balance":3.3,
          "ratings.Compensation_Benefits":2.5,
          "ratings.Job_Security_Advancement":2.7,
          "locations.Auburn__IN":4.7,
          "locations.Findlay__OH":4.3,
          "locations.Warren__MI":4.3,
          "locations.Galesburg__IL":4.0,
          "locations.Hutchinson__MN":4.0,
          "roles.Cashier_Stocker":3.8,
          "roles.Customer_Service_Representative":3.7,
          "roles.Assistant_Manager":3.6,
          "roles.Cashier_Sales":3.5,
          "salary.Sales_Associate":8.69,
          "salary.Team_Member":7.67,
          "interview.experience_":["Average"],
          "_version_":1751934941776576512},
        {
          "name":"Bayfront Health Port Charlotte",
          "rating":3.2,
          "reviews":132,
          "description":"Bayfront Health Port Charlotte is a 254-bed Joint Commission accredited full-service hospital that is committed to caring for people throughout their cycle of life. Recognized locally as a leading health care provider, Bayfront Health Port Charlotte is large enough to offer the continuum of care that you and your family need, but small enough to provide the personal attention that you and your family deserve. – less",
          "happiness.Appreciation":3.35,
          "happiness.Learning":3.35,
          "happiness.Purpose":3.2,
          "happiness.Flexibility":3.1,
          "happiness.Achievement":3.05,
          "happiness.Energy":3.05,
          "happiness.Support":3.0,
          "happiness.Compensation":2.65,
          "happiness.Management":2.6,
          "happiness.Inclusion":2.55,
          "happiness.Belonging":2.55,
          "happiness.Trust":2.5,
          "ratings.Management":2.8,
          "ratings.Culture":3.0,
          "headquarters":"2500 Harbor Blvd Port Charlotte, FL 33952",
          "industry":"Healthcare",
          "custom_rating":3.08,
          "ceo.count":56,
          "ceo.approval":61.0,
          "interview.difficulty":"Medium",
          "interview.duration":"About a day or two",
          "interview.count":19,
          "id":"e0058c52-52d8-438c-ad9e-978561801ac6",
          "happiness.Work_Happiness_Score":2.9,
          "ratings.Work_Life_Balance":3.2,
          "ratings.Compensation_Benefits":3.1,
          "ratings.Job_Security_Advancement":2.9,
          "interview.experience_":["Average"],
          "_version_":1751934940056911872},
        {
          "name":"First Federal Savings and Loan Association of Port Angeles, WA",
          "reviews":0,
          "description":"Our History\n\nFirst Federal is the only community bank headquartered on the North Olympic Peninsula. We opened our doors in 1923 under the name of Lincoln Savings and Loan. As time went on many things changed: Our name, our size, and the ever-growing list of products and services that we offer. We know you will find that our commitment to our communities, to our customers, and to our staff has remained strong.\n\nWe made our first home loan on April 18, 1923, for $500. The proud new owners had a payment of $10.82 per month, wood heat, no electricity and no indoor plumbing! During the lean times of the 1930's we continued to pay dividends to our savings accounts and to make the loans which contributed to the stability and growth of our communities. In the 1940's, First Federal sold war bonds and made money available to returning veterans through the Soldier's and Sailor's Civil Relief Act.\n\nFirst Federal has continued to grow along with the financial needs of our area. Our reason for existence is to supply the community with a safe and sound bank where we encourage savings and invest those savings by making loans to you and your neighbors. This philosophy, and business style has helped people prosper in our community for over 93 years.\n\nToday we are 10 locations strong, serving Clallam, Jefferson, Kitsap and Whatcom Counties from Forks to Port Townsend to Silverdale to Bellingham. First Federal is rooted in the values and traditions that have strengthened our communities, and to this day continues its commitment to provide the best in financial services and community support, because we are community people! – less",
          "industry":"Financial Services",
          "ceo.count":0,
          "interview.count":0,
          "id":"4cbe9605-11ee-4718-b0d9-17c283065e28",
          "_version_":1751934939387920384}]
    }}